GT2/RANS/KEpsilon_realizable_lowRE/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    //default         Gauss linear;
    default         cellMDLimited Gauss linear 1;
    //default         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwind default;

    div(phi,k)      bounded Gauss linearUpwind default; 
    div(phi,omega)  bounded Gauss linearUpwind default; 
    div(phi,epsilon)  bounded Gauss linearUpwind default; 
    div(phi,nuTilda) bounded Gauss linearUpwind default;

    //div(phi,k)      bounded Gauss upwind;
    //div(phi,omega)  bounded Gauss upwind;
    //div(phi,epsilon)  bounded Gauss upwind;
    //div(phi,nuTilda) bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

/*
wallDist
{
    method meshWave;
}
*/

// ************************************************************************* //
